interim-data/c00317d0-0b8d-4b1a-9da0-4233d3afe39f.json

{"guid":"c00317d0-0b8d-4b1a-9da0-4233d3afe39f","title":"About web services","path":"help\\configuration\\using\\about-web-services.md","fullText":"---\nproduct: campaign\ntitle: About web services\ndescription: About web services\nfeature: API\nrole: Data Engineer, Developer\nexl-id: 7aa2aef1-2eb6-48a6-82fa-4451bed66216\n---\n# About web services{#about-web-services}\n\n## Definition of Adobe Campaign APIs {#definition-of-adobe-campaign-apis}\n\nThe Adobe Campaign application server was designed for openness and easy integration with increasingly diverse and complex company information systems.\n\nAdobe Campaign APIs are used in JavaScript within the application and in SOAP outside of it. They make up a library of generic functions that can be enriched. For further information, refer to [Implementing SOAP methods](../../configuration/using/implementing-soap-methods.md).\n\n>[!IMPORTANT]\n>\n>The number of authorized Engine Calls per day varies upon your license contract. For more on this, refer to [this page](https://helpx.adobe.com/legal/product-descriptions/adobe-campaign-classic---product-description.html).   \n>A list of all the APIs including their full description is available in [this dedicated documentation](https://experienceleague.adobe.com/developer/campaign-api/api/index.html.\n\n## Prerequisites {#prerequisites}\n\nBefore using the Adobe Campaign APIs, you need to be familiar with the following topics:\n\n* Javascript\n* SOAP protocol\n* Adobe Campaign datamodel\n\n## Using Adobe Campaign APIs {#using-adobe-campaign-apis}\n\nAdobe Campaign uses two types of APIs:\n\n* Generic data access APIs for querying the datamodel data. Refer to [Data oriented APIs](../../configuration/using/data-oriented-apis.md).\n* Business specific APIs that let you act on each object: deliveries, workflows, subscriptions, etc. Refer to [Business oriented APIs](../../configuration/using/business-oriented-apis.md).\n\nIn order to develop APIs and interact with Adobe Campaign, you need to be familiar with your datamodel. Adobe Campaign lets you generate a complete description of the base. Refer to [Description of the model](../../configuration/using/data-oriented-apis.md#description-of-the-model).\n\n## SOAP calls {#soap-calls}\n\nThe SOAP protocol lets you invoke API methods, via the rich client, third-party applications using webservices, or JSP using these methods natively.\n\n![](assets/s_ncs_configuration_architecture.png)\n\nThe structure of a SOAP message is as follows:\n\n* an envelope which defines the structure of the message,\n* an optional header,\n* a body containing the information about the call and the response,\n* error management that defines the error condition.\n\n## Resources and exchanges {#resources-and-exchanges}\n\nThe following schema shows the various resources involved in the use of Adobe Campaign APIs:\n\n![](assets/s_ncs_integration_webservices_schema_pres.png)\n\n## Example of a SOAP message on the 'ExecuteQuery' method {#example-of-a-soap-message-on-the--executequery--method--}\n\nIn this example, a SOAP query invokes the \"ExecuteQuery\" method, which takes a character string as a parameter for authentication (session token) and an XML content for the description of the query to be executed.\n\nFor further information, refer to [ExecuteQuery (xtk:queryDef)](../../configuration/using/data-oriented-apis.md#executequery--xtk-querydef-).\n\n>[!NOTE]\n>\n>The WSDL description of this service is completed in the example shown here: [Web service description: WSDL](../../configuration/using/web-service-calls.md#web-service-description--wsdl).\n\n### SOAP query {#soap-query}\n\n```\n<?xml version='1.0' encoding='ISO-8859-1'?>\n  <SOAP-ENV:Envelope xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:ns='http://xml.apache.org/xml-soap' xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'>\n    <SOAP-ENV:Body>\n      <ExecuteQuery xmlns='urn:xtk:queryDef' SOAP-ENV:encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'>\n        <__sessiontoken xsi:type='xsd:string'/>\n        <entity xsi:type='ns:Element' SOAP-ENV:encodingStyle='http://xml.apache.org/xml-soap/literalxml'>\n          <queryDef firstRows=\"true\" lineCount=\"200\" operation=\"select\" schema=\"nms:rcpGrpRel\" startLine=\"0\" startPath=\"/\" xtkschema=\"xtk:queryDef\">\n          ...\n          </queryDef>\n        </entity>\n      </ExecuteQuery>\n  </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>\n\n```\n\nThe `<soap-env:envelope>` element is the first element of the message representing the SOAP envelope.\n\nThe `<soap-env:body>` element is the first child element of the envelope. It contains the description of the message, i.e. the content of the query or the response.\n\nThe method to be invoked is entered in the `<executequery>` element from the body of the SOAP message.\n\nIn SOAP, the parameters are recognized by order of appearance. The first parameter, `<__sessiontoken>`, takes the authentication chain, the second parameter is the XML description of the query from the `<querydef>` element.\n\n### SOAP response {#soap-response}\n\n```\n<?xml version='1.0' encoding='ISO-8859-1'?>\n  <SOAP-ENV:Envelope xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:ns='http://xml.apache.org/xml-soap' xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'>\n    <SOAP-ENV:Body>\n      <ExecuteQueryResponse xmlns='urn:xtk:queryDef' SOAP-ENV:encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'>\n        <pdomOutput xsi:type='ns:Element' SOAP-ENV:encodingStyle='http://xml.apache.org/xml-soap/literalxml'>\n          <rcpGrpRel-collection><rcpGrpRel group-id=\"1872\" recipient-id=\"1362\"></rcpGrpRel></rcpGrpRel-collection>\n        </pdomOutput>\n      </ExecuteQueryResponse>\n    </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>\n\n```\n\nThe result of the query is entered from the `<pdomoutput>` element.\n\n## Error management {#error-management}\n\nExample SOAP error response:\n\n```\n<?xml version='1.0' encoding='ISO-8859-1'?>\n<SOAP-ENV:Envelope xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'>\n  <SOAP-ENV:Body>\n    <SOAP-ENV:Fault>\n      <faultcode>SOAP-ENV:Server</faultcode>\n      <faultstring>Error while executing 'Write' of the 'xtk:persist'.</faultstring> service\n      <detail>ODBC error: [Microsoft][ODBC SQL Server Driver][SQL Server]Cannot insert duplicate key row in object 'XtkOption' with unique index 'XtkOption_name'. SQLSTate: 23000\nODBC error: [Microsoft][ODBC SQL Server Driver][SQL Server]The statement has been terminated. SQLSTate: 01000 Cannot save the 'Options (xtk:option)' document </detail>\n    </SOAP-ENV:Fault>\n  </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>\n\n```\n\nThe `<soap-env:fault>` element in the body of the SOAP message is used to convey the error signals arising during the processing of the web service. This is composed of the following sub-elements:\n\n* `<faultcode>` : indicates the type of error. The error types are:\n\n    * \"VersionMismatch\" in the event of incompatibility with the SOAP version used,\n    * \"MustUnderstand\" in the event of a problem in the message header,\n    * \"Client\" in the event that the client is missing some information,\n    * \"Server\" in the event that the server has a problem executing the processing.\n\n* `<faultstring>` : message describing the error\n* `<detail>` : long error message\n\nThe success or failure of the service invocation is identified when the `<faultcode>` element is verified.\n\n>[!IMPORTANT]\n>\n>All Adobe Campaign Web services handle errors. It is therefore strongly recommended to test each call in order to handle returned errors.\n\nExample of error handling in C#:\n\n```\ntry \n{\n  // Invocation of method\n  ...\n}\ncatch (SoapException e)\n{\n  System.Console.WriteLine(\"Soap exception: \" + e.Message);        \n  if (e.Detail != null)\n    System.Console.WriteLine(e.Detail.InnerText);\n}\n\n```\n\n## URL of Web service server (or EndPoint) {#url-of-web-service-server--or-endpoint-}\n\nTo submit the Web service, the Adobe Campaign server that implements the corresponding service method must be contacted.\n\nThe server URL is as follows:\n\nhttps://serverName/nl/jsp/soaprouter.jsp\n\nWith **`<server>`** the Adobe Campaign application server (**nlserver web**).\n","headers":[["title","About web services"],["description","About web services"],["feature","API"]],"sections":[{"section":"About web services","sectionId":"b8ed881f-e8b0-4030-b6cf-f358c333aafb","paragraphs":[]},{"section":"Definition of Adobe Campaign APIs","sectionId":"8b3a9392-4e91-4817-8892-50317d0ed5c7","paragraphs":["The Adobe Campaign application server was designed for openness and easy integration with increasingly diverse and complex company information systems.","Adobe Campaign APIs are used in JavaScript within the application and in SOAP outside of it. They make up a library of generic functions that can be enriched. For further information, refer to Implementing SOAP methods.","IMPORTANT","The number of authorized Engine Calls per day varies upon your license contract. For more on this, refer to this page.\nA list of all the APIs including their full description is available in [this dedicated documentation](https://experienceleague.adobe.com/developer/campaign-api/api/index.html."]},{"section":"Prerequisites","sectionId":"4f99aaf2-732a-489c-9a40-b07195c0ccbb","paragraphs":["Before using the Adobe Campaign APIs, you need to be familiar with the following topics:","Javascript\nSOAP protocol\nAdobe Campaign datamodel"]},{"section":"Using Adobe Campaign APIs","sectionId":"71ef3777-9199-463e-b794-81f9dd9bc55d","paragraphs":["Adobe Campaign uses two types of APIs:","Generic data access APIs for querying the datamodel data. Refer to Data oriented APIs.\nBusiness specific APIs that let you act on each object: deliveries, workflows, subscriptions, etc. Refer to Business oriented APIs.","In order to develop APIs and interact with Adobe Campaign, you need to be familiar with your datamodel. Adobe Campaign lets you generate a complete description of the base. Refer to Description of the model."]},{"section":"SOAP calls","sectionId":"15b38af5-3181-456b-8248-68983bd1c5f5","paragraphs":["The SOAP protocol lets you invoke API methods, via the rich client, third-party applications using webservices, or JSP using these methods natively.","The structure of a SOAP message is as follows:","an envelope which defines the structure of the message,\nan optional header,\na body containing the information about the call and the response,\nerror management that defines the error condition."]},{"section":"Resources and exchanges","sectionId":"58dfecea-e35e-44ba-97e5-14c9222f4423","paragraphs":["The following schema shows the various resources involved in the use of Adobe Campaign APIs:"]},{"section":"Example of a SOAP message on the 'ExecuteQuery' method","sectionId":"681b11d8-08cd-4bae-8cb9-e983e49bc3e7","paragraphs":["In this example, a SOAP query invokes the \"ExecuteQuery\" method, which takes a character string as a parameter for authentication (session token) and an XML content for the description of the query to be executed.","For further information, refer to ExecuteQuery (xtk:queryDef).","NOTE","The WSDL description of this service is completed in the example shown here: Web service description: WSDL."]},{"section":"SOAP query","sectionId":"b4a8de30-8c87-42a0-837f-fb068c45d20b","paragraphs":["<?xml version='1.0' encoding='ISO-8859-1'?>\n  <SOAP-ENV:Envelope xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:ns='http://xml.apache.org/xml-soap' xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'>\n    <SOAP-ENV:Body>\n      <ExecuteQuery xmlns='urn:xtk:queryDef' SOAP-ENV:encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'>\n        <__sessiontoken xsi:type='xsd:string'/>\n        <entity xsi:type='ns:Element' SOAP-ENV:encodingStyle='http://xml.apache.org/xml-soap/literalxml'>\n          <queryDef firstRows=\"true\" lineCount=\"200\" operation=\"select\" schema=\"nms:rcpGrpRel\" startLine=\"0\" startPath=\"/\" xtkschema=\"xtk:queryDef\">\n          ...\n          </queryDef>\n        </entity>\n      </ExecuteQuery>\n  </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>","The <soap-env:envelope> element is the first element of the message representing the SOAP envelope.","The <soap-env:body> element is the first child element of the envelope. It contains the description of the message, i.e. the content of the query or the response.","The method to be invoked is entered in the <executequery> element from the body of the SOAP message.","In SOAP, the parameters are recognized by order of appearance. The first parameter, <__sessiontoken>, takes the authentication chain, the second parameter is the XML description of the query from the <querydef> element."]},{"section":"SOAP response","sectionId":"7e08a08e-82ec-4f5d-b016-06d47c290c1d","paragraphs":["<?xml version='1.0' encoding='ISO-8859-1'?>\n  <SOAP-ENV:Envelope xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:ns='http://xml.apache.org/xml-soap' xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'>\n    <SOAP-ENV:Body>\n      <ExecuteQueryResponse xmlns='urn:xtk:queryDef' SOAP-ENV:encodingStyle='http://schemas.xmlsoap.org/soap/encoding/'>\n        <pdomOutput xsi:type='ns:Element' SOAP-ENV:encodingStyle='http://xml.apache.org/xml-soap/literalxml'>\n          <rcpGrpRel-collection><rcpGrpRel group-id=\"1872\" recipient-id=\"1362\"></rcpGrpRel></rcpGrpRel-collection>\n        </pdomOutput>\n      </ExecuteQueryResponse>\n    </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>","The result of the query is entered from the <pdomoutput> element."]},{"section":"Error management","sectionId":"5046fd5b-21ff-47de-bb50-c146394514eb","paragraphs":["Example SOAP error response:","<?xml version='1.0' encoding='ISO-8859-1'?>\n<SOAP-ENV:Envelope xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'>\n  <SOAP-ENV:Body>\n    <SOAP-ENV:Fault>\n      <faultcode>SOAP-ENV:Server</faultcode>\n      <faultstring>Error while executing 'Write' of the 'xtk:persist'.</faultstring> service\n      <detail>ODBC error: [Microsoft][ODBC SQL Server Driver][SQL Server]Cannot insert duplicate key row in object 'XtkOption' with unique index 'XtkOption_name'. SQLSTate: 23000\nODBC error: [Microsoft][ODBC SQL Server Driver][SQL Server]The statement has been terminated. SQLSTate: 01000 Cannot save the 'Options (xtk:option)' document </detail>\n    </SOAP-ENV:Fault>\n  </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>","The <soap-env:fault> element in the body of the SOAP message is used to convey the error signals arising during the processing of the web service. This is composed of the following sub-elements:","<faultcode> : indicates the type of error. The error types are:","\"VersionMismatch\" in the event of incompatibility with the SOAP version used,\n\"MustUnderstand\" in the event of a problem in the message header,\n\"Client\" in the event that the client is missing some information,\n\"Server\" in the event that the server has a problem executing the processing.","<faultstring> : message describing the error","<detail> : long error message","The success or failure of the service invocation is identified when the <faultcode> element is verified.","IMPORTANT","All Adobe Campaign Web services handle errors. It is therefore strongly recommended to test each call in order to handle returned errors.","Example of error handling in C#:","try \n{\n  // Invocation of method\n  ...\n}\ncatch (SoapException e)\n{\n  System.Console.WriteLine(\"Soap exception: \" + e.Message);        \n  if (e.Detail != null)\n    System.Console.WriteLine(e.Detail.InnerText);\n}"]},{"section":"URL of Web service server (or EndPoint)","sectionId":"c82a6d5f-05d5-4c7b-a10a-31a84f603414","paragraphs":["To submit the Web service, the Adobe Campaign server that implements the corresponding service method must be contacted.","The server URL is as follows:","https://serverName/nl/jsp/soaprouter.jsp","With <server> the Adobe Campaign application server (nlserver web)."]}]}